In [1]:
import pandas as pd
from sqlalchemy import create_engine
from config import db_username, db_password

### Analyzing the employees table

In [2]:
employees_df = pd.read_csv("data/employees.csv")
employees_df.head()

   emp_no emp_title_id  birth_date  first_name  last_name sex   hire_date
0  473302        s0001   7/25/1953    Hideyuki   Zallocco   M   4/28/1990
1  475053        e0002  11/18/1954       Byong  Delgrande   F    9/7/1991
2   57444        e0002   1/30/1958       Berry       Babb   F   3/21/1992
3  421786        s0001   9/28/1957       Xiong   Verhoeff   M  11/26/1987
4  282238        e0003  10/28/1952  Abdelkader    Baumann   F   1/18/1991

In [3]:
employees_df.dtypes

emp_no           int64
emp_title_id    object
birth_date      object
first_name      object
last_name       object
sex             object
hire_date       object
dtype: object

In [4]:
employees_df.columns

Index(['emp_no', 'emp_title_id', 'birth_date', 'first_name', 'last_name',
       'sex', 'hire_date'],
      dtype='object')

In [5]:
df = employees_df.emp_no.unique()
len(df)

300024

In [6]:
df = employees_df.emp_title_id.unique()
len(df)

7

In [7]:
departments_df = pd.read_csv("data/departments.csv")
departments_df

  dept_no           dept_name
0    d001           Marketing
1    d002             Finance
2    d003     Human Resources
3    d004          Production
4    d005         Development
5    d006  Quality Management
6    d007               Sales
7    d008            Research
8    d009    Customer Service

In [8]:
departments_df.dtypes

dept_no      object
dept_name    object
dtype: object

In [9]:
departments_df.columns

Index(['dept_no', 'dept_name'], dtype='object')

In [10]:
dept_emp_df = pd.read_csv("data/dept_emp.csv")
dept_emp_df.head()

   emp_no dept_no
0   10001    d005
1   10002    d007
2   10003    d004
3   10004    d004
4   10005    d003

In [11]:
dept_emp_df.dtypes

emp_no      int64
dept_no    object
dtype: object

In [12]:
dept_emp_df.columns

Index(['emp_no', 'dept_no'], dtype='object')

In [15]:
df = dept_emp_df.emp_no.unique()
len(df)

300024

In [16]:
len(dept_emp_df)

331603

In [14]:
dept_manager_df = pd.read_csv("data/dept_manager.csv")
dept_manager_df.head()

  dept_no  emp_no
0    d001  110022
1    d001  110039
2    d002  110085
3    d002  110114
4    d003  110183

In [19]:
dept_manager_df.dtypes

dept_no    object
emp_no      int64
dtype: object

In [20]:
dept_manager_df.columns

Index(['dept_no', 'emp_no'], dtype='object')

In [21]:
salaries_df = pd.read_csv("data/salaries.csv")
salaries_df.head()

   emp_no  salary
0   10001   60117
1   10002   65828
2   10003   40006
3   10004   40054
4   10005   78228

In [22]:
salaries_df.dtypes

emp_no    int64
salary    int64
dtype: object

In [23]:
salaries_df.columns

Index(['emp_no', 'salary'], dtype='object')

In [24]:
titles_df = pd.read_csv("data/titles.csv")
titles_df.head()

  title_id               title
0    s0001               Staff
1    s0002        Senior Staff
2    e0001  Assistant Engineer
3    e0002            Engineer
4    e0003     Senior Engineer

In [31]:
df = titles_df.title_id.unique()
len(df)

7

In [25]:
titles_df.dtypes

title_id    object
title       object
dtype: object

In [26]:
titles_df.columns

Index(['title_id', 'title'], dtype='object')

### SQL Alchamy:

In [7]:
engine = create_engine(f'postgresql://{db_username}:{db_password}@localhost:5432/employees_db')
connection = engine.connect()

In [8]:
pd.read_sql("select * from employees", connection)

,emp_no,emp_title_id,birth_date,first_name,last_name,sex,hire_date
0,473302,s0001,1953-07-25,Hideyuki,Zallocco,M,1990-04-28
1,475053,e0002,1954-11-18,Byong,Delgrande,F,1991-09-07
2,57444,e0002,1958-01-30,Berry,Babb,F,1992-03-21
3,421786,s0001,1957-09-28,Xiong,Verhoeff,M,1987-11-26
4,282238,e0003,1952-10-28,Abdelkader,Baumann,F,1991-01-18
...,...,...,...,...,...,...,...
300019,464231,s0001,1958-08-14,Constantino,Eastman,M,1988-10-28
300020,255832,e0002,1955-05-08,Yuping,Dayang,F,1995-02-26
300021,76671,s0001,1959-06-09,Ortrud,Plessier,M,1988-02-24
300022,264920,s0001,1959-09-22,Percy,Samarati,F,1994-09-08
300023,464503,s0002,1964-05-31,Arvind,Slobodova,M,1987-11-23